Autodesk.Revit.DB.NumberingSequenceInfo.HasGaps
True if the sequence has gaps

Autodesk.Revit.DB.NumberingSequenceInfo.Count
Number of elements in the sequence

Autodesk.Revit.DB.NumberingSequenceInfo.LastNumber
Last number in the sequence

Autodesk.Revit.DB.NumberingSequenceInfo.FirstNumber
First number in the sequence

Autodesk.Revit.DB.NumberingSequenceInfo.FormattedLastNumber
First number in the sequence formatted

Autodesk.Revit.DB.NumberingSequenceInfo.FormattedFirstNumber
First number in the sequence formatted

Autodesk.Revit.DB.NumberingSequenceInfo.PartitionName
identifier for the partition

Autodesk.Revit.DB.NumberingSequenceInfo.#ctor(System.String,System.String,System.String,System.Int32,System.Int32,System.Int32,System.Boolean)
Create an NumberingSequenceInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.NumberingSequenceInfo.#ctor
Create an empty AdvancedNumberingSchemaSettings object.

Autodesk.Revit.DB.NumberingSequenceInfo
A class containing the information regarding a numbering sequence to be used in the UI